"Automatically Install" = "Asenna automaattisesti";

"Delete After Install" = "Poista asennuksen jälkeen";

"Remove Metadata"="Poista Metadata";

"Keep Awake"="Pidä hereillä";

"This will keep your screen always ON while using AppCake"="Tämä pitää näyttösi kokoajan päällä kun AppCake on käynnissä";

"Remove Metadata will stop App Store from updating the app"="Metadatan poistaminen estää AppStorea päivittämästä sovellusta";

"Enable iTunes Sync to make apps installed by AppCake can be transfered to your computer by iTunes."="Kytke iTunes Sync päälle, jotta AppCakesta ladatut ohjelmat voidaan syncronoida tietokoneellesi iTunesiin";

"iTunes Sync"="iTunes Sync";

"Feedback"="Palaute";

"Changelog"="Muutosloki";

"I Can Translate"="Osaan kääntää";

"Clear Image Cache"="Tyhjennä kuvavälimuisti";

"Settings" = "Asetukset";

"Show iPhone Apps" = "Näytä iPhone-sovellukset";
